export const resCountriesAPI_all = 'https://restcountries.com/v3.1/all';//main url

export const russianAlphabet = [
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М',
    'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',
    'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м',
    'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'
];

export const englishAlphabet = [
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'
];

export const kazakhAlphabet = [
    'А', 'Ә', 'Б', 'В', 'Г', 'Ғ', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Қ',
    'Л', 'М', 'Н', 'Ң', 'О', 'Ө', 'П', 'Р', 'С', 'Т', 'У', 'Ұ', 'Ү', 'Ф', 'Х',
    'Һ', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'І', 'Ь', 'Э', 'Ю', 'Я',
    'а', 'ә', 'б', 'в', 'г', 'ғ', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'қ',
    'л', 'м', 'н', 'ң', 'о', 'ө', 'п', 'р', 'с', 'т', 'у', 'ұ', 'ү', 'ф', 'х',
    'һ', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'і', 'ь', 'э', 'ю', 'я'
];

// Китайский (упрощенный)
export const chineseSimplifiedAlphabet = [
    '一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '百', '千', '万', '亿',
    '中', '国', '语', '是', '一', '门', '很', '有', '意', '思', '的', '语', '言'
];

// Китайский (традиционный)
export const chineseTraditionalAlphabet = [
    '一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '百', '千', '萬', '億',
    '中', '國', '語', '是', '一', '門', '很', '有', '意', '思', '的', '語', '言'
];

// Японский (хирагана и катакана)
export const japaneseAlphabet = [
    'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ',
    'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ',
    'ま', 'み', 'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん',
    'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ',
    'タ', 'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
    'マ', 'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヲ', 'ン'
];

export const cifres = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];

export const daysOfWeekEnglish = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'];

export const monthsEnglish = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];

//Категории продуктов:
export const productCategories = ['Electronics', 'Clothing', 'Books', 'Home & Garden', 'Toys'];

// На русском языке
export const weekdays = {
    'ru': ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
    'kk': ['Дүйсенбі', 'Сейсенбі', 'Сәрсенбі', 'Бейсенбі', 'Жұма', 'Сенбі', 'Жексенбі'],
    'en': ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
  };
  

export const seasons = {
    'ru': ['Весна', 'Лето', 'Осень', 'Зима'],
    'kk': ['Көктем', 'Жаз', 'Желтоқсан', 'Қыс'],
    'en': ['Spring', 'Summer', 'Autumn', 'Winter']
  };
  
//Типы транспорта:
export const transportationModes = ['Автомобиль', 'Велосипед', 'Пешком', 'Поезд', 'Самолет', 'Корабль'];

//Категории рецептов:
export const recipeCategories = ['Завтрак', 'Обед', 'Ужин', 'Десерт', 'Закуска', 'Напиток'];

//Список стран мира
export const countriesRussian = ["Афганистан", "Албания", "Алжир", "Самоа", "Андорра", "Ангола",
    "Ангилья ", "Антигуа и Барбуда", "Аргентина ", "Армения ", "Аруба",
    "Австралия ", "Австрия ", "Азербайджан", " Бахрейн", "Бангладеш",
    "Барбадос", "Белоруссия", "Бельгия", " Бенин", "Бермуды ", "Бутан",
    "Боливия", "Босния и Герцеговина", "Ботсвана ", "Бразилия ", "Бруней",
    "Болгария", "Буркина-Фасо", "Бирма (Мьянма)", "Бурунди", "Камбоджа", "Камерун ",
    "Канада", "Канарские острова", "Кабо-Верде", "Центральноафриканская Республика",
    "Чад", "Чили", "Китай", "Колумбия", "Коморы", "Конго", "Коста-Рика ", "Хорватия",
    "Куба", "Кипр", "Чехия", "Дания", "Джибути", "Доминика", "Доминиканская Республика",
    "Эквадор", "Египет ", "Сальвадор", "Экваториальная Гвинея", "Эритрея", "Эстония",
    "Эфиопия", "Фолклендские острова", "Фиджи", "Финляндия", "Франция", "Французская Гвиана",
    "Французская Полинезия", "Габон", "Грузия", "Германия", "Гана", "Гибралтар", "Греция",
    "Гренландия", "Гренада", "Гваделупа", "Гуам", "Гватемала", "Гвинея", "Гвинея-Бисау", "Гайана",
    "Гаити", "Гондурас", "Венгрия", "Исландия", "Индия", "Индонезия", "Иран", "Ирак", "Ирландия",
    "Израиль", "Италия", "Кот-д’Ивуар", "Ямайка", "Япония", "Джонстон (атолл)", "Иордания",
    "Турецкая Республика Северного Кипра", "Казахстан", "Кения", "Французские Южные и Антарктические Территории",
    "Кирибати", "Кувейт", "Кыргызстан", "Лаос", "Латвия", "Ливан", "Лесото", "Либерия", "Ливия", "Литва", "Люксембург",
    "Республика Македония", "Мадагаскар", "Малави", "Малайзия", "Мальдивы", "Мали", "Мальта", "Маршалловы Острова",
    "Мартиника", "Мавритания", "Маврикий", "Мексика", "Федеративные Штаты Микронезии", "Мидуэй", "Молдавия", "Монако",
    "Монголия", "Монтсеррат", "Марокко", "Мозамбик", "Намибия", "Непал", "Нидерланды", "Нидерландские Антильские острова",
    "Новая Каледония", "Новая Зеландия", "Никарагуа", "Нигер", "Нигерия", "Корейская Народно-Демократическая Республика",
    "Северная Ирландия", "Северные Марианские острова", "Норвегия", "Оман", "Пакистан", "Палау", "Пальмира", "Панама",
    "Папуа — Новая Гвинея", "Парагвай", "Перу", "Филиппины", "Польша", "Португалия", "Пуэрто-Рико", "Катар", "Реюньон",
    "Румыния", "Российская Федерация", "Руанда", "Остров Святой Елены", "Сент-Винсент и Гренадины", "Сан-Марино",
    "Саудовская Аравия", "Сенегал", "Сейшельские Острова", "Сьерра-Леоне", "Сингапур", "Словакия", "Словения",
    "Соломоновы Острова", "Сомали", "Южно-Африканская Республика", "Южная Георгия и Южные Сандвичевы острова",
    "Республика Корея", "Испания", "Шри-Ланка", "Сент-Китс и Невис", "Сент-Люсия", "Сен-Пьер и Микелон", "Судан",
    "Суринам", "Свазиленд", "Швеция", "Швейцария", "Сирия", "Тайвань", "Таджикистан", "Танзания", "Таиланд",
    "Багамские Острова", "Гамбия", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", "Турция", "Туркмения",
    "Теркс и Кайкос", "Объединённые Арабские Эмираты", "Великобритания", "США", "Уганда", "Украина", "Уругвай",
    "Узбекистан", "Вануату", "Венесуэла", "Вьетнам", "Уэйк", "Уэльс", "Самоа", "Йемен", "Демократическая Республика Конго",
    "Замбия", "Зимбабве", "Лихтенштейн", "Каймановы острова", "Остров Рождества", "Косово", "Макао", "Майотта", "Черногория",
    "Ниуэ", "Палестина", "Сен-Мартен", "Сан-Томе и Принсипи", "Сербия", "Шпицберген и Ян-Майен", "Восточный Тимор", "Тувалу",
    "Виргинские острова Америка", "Виргинские острова", "Уоллис и Футуна", "Белиз", "Науру"];

export const countriesKazakh = ["Ауғанстан", "Албания", "Алжир", "Самоа", "Андорра", "Ангола", "Ангилья ", "Антигуа және Барбуда",
    "Аргентина ", "Армения ", " Аруба ", "Аустралия ", "Австрия ", "Әзірбайжан", "Бахрейн", "Бангладеш",
    "Барбадос", "Беларусь ", "Бельгия", " Бенин", "Бермудалар", "Бутан", "Боливия", "Босния және Герцеговина",
    "Ботсвана ", "Бразилия ", "Бруней", "Болгария", "Буркина-Фасо", "Бирма (Мианма)", "Бурунди", "Камбоджа",
    "Камерун ", "Канада", "Канар аралдары", "Кабо-Верде", "Орталық Африка Республикасы", "Чад", "Чили", "Қытай",
    "Колумбия", "Қамарлар ", "Конго", "Коста-Рика ", "Хорватия", "Куба", "Кипр", "Чехия", "Дания", "Джибути",
    "Доминика", "Доминикан Республикасы", "Екуадор", "Мысыр", "Сальвадор", "Экваторлық Гвинея", "Эритрея",
    "Эстония", "Эфиопия", "Фолкленд аралдары", "Фиджи", "Финляндия", "Франция", "Француз Гвианасы",
    "Полинезия (фр.)", "Габон", "Грузия", "Алмания", "Гана", "Гибралтар", "Грекия", "Гренландия", "Гренада",
    "Гваделупа", "Гуам", "Гватемала", "Гвинея", "Гвинея-Бисау", "Гайана", "Гаити", "Гондурас", "Венгрия", "Исландия",
    "Үндістан", "Индонезия", "Иран", "Ирак", "Ирландия", "Израиль", "Италия", "Кот-д-Ивуар", "Ямайка", "Жапония",
    "Джонстон (атолл)", "Иордания", "Солтүстік Кипр Түрік Республикасы", "Қазақстан", "Кения",
    "Оңтүстік және Антарктика француз Аймақтары", "Кирибати", "Кувейт", "Қырғызстан", "Лаос", "Латвия", "Ливан",
    "Лесото", "Либерия", "Ливия", "Литва", "Люксембург", "Македония Республикасы", "Мадагаскар", "Малави", "Малайзия",
    "Мальдив", "Мали", "Мальта", "Маршал Аралдары", "Мартиника", "Мавритания", "Маврикий", "Мексика",
    "Микронезия Федеративтік Штаттары ", "Мидуэй аралдары", "Молдавия", "Монако", "Моңғолия", "Монтсеррат",
    "Марокко", "Мозамбик", "Намибия", "Непал", "Нидерланд", "Нидерланд Антиль аралдары", "Жаңа Каледония",
    "Жаңа Зеландия", "Никарагуа", "Нигер", "Нигерия", "Корей Халық Демократиялық Республикасы", "Солтүстік Ирландия",
    "Солтүстік Мариан аралдары", "Норвегия", "Оман", "Пәкістан", "Палау", "Пальмира", "Панама", "Папуа — Жаңа Гвинея",
    "Парагвай", "Перу", "Филиппин", "Польша", "Португалия", "Пуэрто-Рико", "Катар", "Реюньон", "Румыния",
    "Ресей Федерациясы", "Руанда", "Saint Helena", "Сент-Винсент және Гренадин", "Сан-Марино", "Сауд Арабиясы",
    "Сенегал", "Сейшел аралдары", "Сьерра-Леоне", "Сингапур", "Словакия", "Словения", "Соломон аралдары", "Сомали",
    "Оңтүстік Африка Республикасы", "Оңтүстік Георгия және Оңтүстік Сандвич аралдары", "Кәріс Республикасы",
    "Испания", "Шри-Ланка", "Сент-Китс және Невис", "Сент-Люсия", "Сен-Пьер және Микелон", "Судан", "Суринам",
    "Свазиленд", "Швеция", "Швейцария", "Сирия", "Тайвань", "Тәжікстан", "Танзания", "Таиланд", "Багам аралдары",
    "Гамбия", "Того", "Тонга", "Тринидад және Тобаго", "Тунис", "Түркия", "Түрікменстан", "Теркс және Кайкос",
    "Біріккен Араб Әмірлігі", "Ұлыбритания", "АҚШ", "Уганда", "Украина", "Уругвай", "Өзбекстан", "Вануату", "Венесуэла",
    "Вьетнам", "Уэйк аралдары", "Уэльс", "Самоа", "Йемен", "Конго Демократиялық Республикасы", "Замбия", "Зимбабве",
    "Лихтенштейн", "Кайман аралдары", "Рождество аралдары", "Косово", "Макао", "Майотта", "Черногория", "Ниуэ", "Палестина",
    "Сен-Мартен", "Сан-Томе және Принсипи", "Сербия", "Шпицберген және Ян-Майен", "Шығыс Тимор", "Тувалу",
    "Виргин аралдары Америка", "Виргин аралдары", "Уоллис және Футуна", "Белиз", "Науру"];
// Переводчик
export const Google_Translator_Link = "https://translate.googleapis.com/translate_a/single?client=gtx&sl=" + sourceLang + "&tl=" + targetLang + "&dt=t&q=" + encodeURI(text);

//Коды языков для гугл переводчика
export const languageOptions = {
    'kk': 'Қазақ',
    'en': 'Ағылшын',
    'fr': 'Француз',
    'de': 'Неміс',
    'ru': 'Орыс',
    'ky': 'Қырғыз',
    'uz': 'Өзбек',
    'ca': 'Каталан',
    'ar': 'Араб',
    'be': 'Белорусь',
    'es': 'Испан',
    'cy': 'Валий',
    'ja': 'Жапон',
    'zh': 'Қытай',
    'af': 'Африкаанс',
    'ak': 'Акан',
    'am': 'Амхар',
    'as': 'Бенгал',
    'ay': 'Аймара',
    'az': 'Азербайжан',
    'bg': 'Болгар',
    'bh': 'Бходжпури',
    'bm': 'Бамбара',
    'bn': 'Бенгал',
    'bs': 'Қытай 2'
};

export const currenciesValuteNames_English = {
    'AED': 'United Arab Emirates Dirham',
    'AFN': 'Afghan Afghani',
    'ALL': 'Albanian Lek',
    'AMD': 'Armenian Dram',
    'ANG': 'Netherlands Antillean Guilder',
    'AOA': 'Angolan Kwanza',
    'ARS': 'Argentine Peso',
    'AUD': 'Australian Dollar',
    'AWG': 'Aruban Florin',
    'AZN': 'Azerbaijani Manat',
    'BAM': 'Bosnia-Herzegovina Convertible Mark',
    'BBD': 'Barbadian Dollar',
    'BDT': 'Bangladeshi Taka',
    'BGN': 'Bulgarian Lev',
    'BHD': 'Bahraini Dinar',
    'BIF': 'Burundian Franc',
    'BMD': 'Bermudian Dollar',
    'BND': 'Brunei Dollar',
    'BOB': 'Bolivian Boliviano',
    'BRL': 'Brazilian Real',
    'BSD': 'Bahamian Dollar',
    'BTN': 'Bhutanese Ngultrum',
    'BWP': 'Botswanan Pula',
    'BYN': 'Belarusian Ruble',
    'BZD': 'Belize Dollar',
    'CAD': 'Canadian Dollar',
    'CDF': 'Congolese Franc',
    'CHF': 'Swiss Franc',
    'CLP': 'Chilean Peso',
    'CNY': 'Chinese Yuan',
    'COP': 'Colombian Peso',
    'CRC': 'Costa Rican Colón',
    'CUP': 'Cuban Peso',
    'CVE': 'Cape Verdean Escudo',
    'CZK': 'Czech Republic Koruna',
    'DJF': 'Djiboutian Franc',
    'DKK': 'Danish Krone',
    'DOP': 'Dominican Peso',
    'DZD': 'Algerian Dinar',
    'EGP': 'Egyptian Pound',
    'ERN': 'Eritrean Nakfa',
    'ETB': 'Ethiopian Birr',
    'EUR': 'Euro',
    'FJD': 'Fijian Dollar',
    'FKP': 'Falkland Islands Pound',
    'FOK': 'Faroese Króna',
    'GBP': 'British Pound Sterling',
    'GEL': 'Georgian Lari',
    'GGP': 'Guernsey Pound',
    'GHS': 'Ghanaian Cedi',
    'GIP': 'Gibraltar Pound',
    'GMD': 'Gambian Dalasi',
    'GNF': 'Guinean Franc',
    'GTQ': 'Guatemalan Quetzal',
    'GYD': 'Guyanaese Dollar',
    'HKD': 'Hong Kong Dollar',
    'HNL': 'Honduran Lempira',
    'HRK': 'Croatian Kuna',
    'HTG': 'Haitian Gourde',
    'HUF': 'Hungarian Forint',
    'IDR': 'Indonesian Rupiah',
    'ILS': 'Israeli New Shekel',
    'IMP': 'Isle of Man Pound',
    'INR': 'Indian Rupee',
    'IQD': 'Iraqi Dinar',
    'IRR': 'Iranian Rial',
    'ISK': 'Icelandic Króna',
    'JEP': 'Jersey Pound',
    'JMD': 'Jamaican Dollar',
    'JOD': 'Jordanian Dinar',
    'JPY': 'Japanese Yen',
    'KES': 'Kenyan Shilling',
    'KGS': 'Kyrgystani Som',
    'KHR': 'Cambodian Riel',
    'KID': 'Kiribati Dollar',
    'KRW': 'South Korean Won',
    'KWD': 'Kuwaiti Dinar',
    'KYD': 'Cayman Islands Dollar',
    'KZT': 'Kazakhstani Tenge',
    'LAK': 'Laotian Kip',
    'LBP': 'Lebanese Pound',
    'LKR': 'Sri Lankan Rupee',
    'LRD': 'Liberian Dollar',
    'LSL': 'Lesotho Loti',
    'LYD': 'Libyan Dinar',
    'MAD': 'Moroccan Dirham',
    'MDL': 'Moldovan Leu',
    'MGA': 'Malagasy Ariary',
    'MKD': 'Macedonian Denar',
    'MMK': 'Myanmar Kyat',
    'MNT': 'Mongolian Tugrik',
    'MOP': 'Macanese Pataca',
    'MRU': 'Mauritanian Ouguiya',
    'MUR': 'Mauritian Rupee',
    'MVR': 'Maldivian Rufiyaa',
    'MWK': 'Malawian Kwacha',
    'MXN': 'Mexican Peso',
    'MYR': 'Malaysian Ringgit',
    'MZN': 'Mozambican Metical',
    'NAD': 'Namibian Dollar',
    'NGN': 'Nigerian Naira',
    'NIO': 'Nicaraguan Córdoba',
    'NOK': 'Norwegian Krone',
    'NPR': 'Nepalese Rupee',
    'NZD': 'New Zealand Dollar',
    'OMR': 'Omani Rial',
    'PAB': 'Panamanian Balboa',
    'PEN': 'Peruvian Nuevo Sol',
    'PGK': 'Papua New Guinean Kina',
    'PHP': 'Philippine Peso',
    'PKR': 'Pakistani Rupee',
    'PLN': 'Polish Złoty',
    'PYG': 'Paraguayan Guarani',
    'QAR': 'Qatari Rial',
    'RON': 'Romanian Leu',
    'RSD': 'Serbian Dinar',
    'RUB': 'Russian Ruble',
    'RWF': 'Rwandan Franc',
    'SAR': 'Saudi Riyal',
    'SBD': 'Solomon Islands Dollar',
    'SCR': 'Seychellois Rupee',
    'SDG': 'Sudanese Pound',
    'SEK': 'Swedish Krona',
    'SGD': 'Singapore Dollar',
    'SHP': 'Saint Helena Pound',
    'SLL': 'Sierra Leonean Leone',
    'SOS': 'Somali Shilling',
    'SRD': 'Surinamese Dollar',
    'SSP': 'South Sudanese Pound',
    'STN': 'São Tomé and Príncipe Dobra',
    'SYP': 'Syrian Pound',
    'SZL': 'Swazi Lilangeni',
    'THB': 'Thai Baht',
    'TJS': 'Tajikistani Somoni',
    'TMT': 'Turkmenistani Manat',
    'TND': 'Tunisian Dinar',
    'TOP': "Tongan Pa'anga",
    'TRY': 'Turkish Lira',
    'TTD': 'Trinidad and Tobago Dollar',
    'TVD': 'Tuvaluan Dollar',
    'TWD': 'New Taiwan Dollar',
    'TZS': 'Tanzanian Shilling',
    'UAH': 'Ukrainian Hryvnia',
    'UGX': 'Ugandan Shilling',
    'USD': 'United States Dollar',
    'UYU': 'Uruguayan Peso',
    'UZS': 'Uzbekistan Som',
    'VES': 'Venezuelan Bolívar',
    'VND': 'Vietnamese Đồng',
    'VUV': 'Vanuatu Vatu',
    'WST': 'Samoan Tala',
    'XAF': 'Central African CFA franc',
    'XCD': 'Eastern Caribbean Dollar',
    'XDR': 'Special Drawing Rights',
    'XOF': 'West African CFA franc',
    'XPF': 'CFP franc',
    'YER': 'Yemeni Rial',
    'ZAR': 'South African Rand',
    'ZMW': 'Zambian Kwacha',
    'ZWL': 'Zimbabwean Dollar'};
  
export const timeUnits = {
    'ru': ['секунда', 'минута', 'час', 'сутки', 'неделя', 'месяц', 'год', 'десятилетие'],
    'kk': ['секунд', 'минут', 'сағат', 'күн', 'апта', 'ай', 'жыл', 'онжылдық'],
    'en': ['second', 'minute', 'hour', 'day', 'week', 'month', 'year', 'decade']
  };
  
export const distanceUnits = {
    'ru': {
      'unit': 'метр',
      'translations': {
        'миллиметр': 0.001,
        'сантиметр': 0.01,
        'метр': 1,
        'километр': 1000,
        'дюйм': 0.0254,
        'фут': 0.3048,
        'ярд': 0.9144,
        'миля': 1609.34
      }
    },
    'kk': {
      'unit': 'метр',
      'translations': {
        'миллиметр': 0.001,
        'сантиметр': 0.01,
        'метр': 1,
        'кілометр': 1000,
        'дюйм': 0.0254,
        'фут': 0.3048,
        'жарық': 0.9144,
        'милли': 1609.34
      }
    },
    'en': {
      'unit': 'meter',
      'translations': {
        'millimeter': 0.001,
        'centimeter': 0.01,
        'meter': 1,
        'kilometer': 1000,
        'inch': 0.0254,
        'foot': 0.3048,
        'yard': 0.9144,
        'mile': 1609.34
      }
    }
  };
  
export const massUnits = {
    'ru': {
      'unit': 'килограмм',
      'translations': {
        'грамм': 0.001,
        'килограмм': 1,
        'тонна': 1000,
        'унция': 0.0283495,
        'фунт': 0.453592,
        'стоун': 6.35029
      }
    },
    'kk': {
      'unit': 'килограмм',
      'translations': {
        'грамм': 0.001,
        'килограмм': 1,
        'тонна': 1000,
        'унция': 0.0283495,
        'фунт': 0.453592,
        'стоун': 6.35029
      }
    },
    'en': {
      'unit': 'kilogram',
      'translations': {
        'gram': 0.001,
        'kilogram': 1,
        'tonne': 1000,
        'ounce': 0.0283495,
        'pound': 0.453592,
        'stone': 6.35029
      }
    }
  };

    export const volumeUnits = {
    'ru': {
      'unit': 'литр',
      'translations': {
        'миллилитр': 0.001,
        'литр': 1,
        'кубический метр': 1000,
        'галлон': 3.78541,
        'кварт': 0.946353,
        'пинта': 0.473176,
        'жидкая унция': 0.0295735
      }
    },
    'kk': {
      'unit': 'литр',
      'translations': {
        'миллилитр': 0.001,
        'литр': 1,
        'куб метр': 1000,
        'галлон': 3.78541,
        'кварт': 0.946353,
        'пинта': 0.473176,
        'суық унция': 0.0295735
      }
    },
    'en': {
      'unit': 'liter',
      'translations': {
        'milliliter': 0.001,
        'liter': 1,
        'cubic meter': 1000,
        'gallon': 3.78541,
        'quart': 0.946353,
        'pint': 0.473176,
        'fluid ounce': 0.0295735
      }
    }
  };
  
  export const temperatureUnits = {
    'ru': ['Цельсий', 'Кельвин', 'Фаренгейт'],
    'kk': ['Цельсий', 'Кельвин', 'Фаренгейт'],
    'en': ['Celsius', 'Kelvin', 'Fahrenheit']
  };
  
  export const speedUnits = {
    'ru': {
      'unit': 'метр в секунду',
      'translations': {
        'метр в секунду': 1,
        'километр в час': 0.277778,
        'миля в час': 0.44704
      }
    },
    'kk': {
      'unit': 'метр секундада',
      'translations': {
        'метр секундада': 1,
        'кілометр сағатта': 0.277778,
        'миля сағатта': 0.44704
      }
    },
    'en': {
      'unit': 'meter per second',
      'translations': {
        'meter per second': 1,
        'kilometer per hour': 0.277778,
        'mile per hour': 0.44704
      }
    }
  };
  
  export const areaUnits = {
    'ru': {
      'unit': 'квадратный метр',
      'translations': {
        'квадратный метр': 1,
        'квадратный километр': 1000000,
        'гектар': 10000,
        'ар': 100,
        'квадратный миллиметр': 0.000001,
        'квадратный сантиметр': 0.0001,
        'квадратный дециметр': 0.01,
        'квадратный километр': 1000000
      }
    },
    'kk': {
      'unit': 'квадрат метр',
      'translations': {
        'квадрат метр': 1,
        'квадрат кілометр': 1000000,
        'гектар': 10000,
        'ар': 100,
        'квадрат миллиметр': 0.000001,
        'квадрат сантиметр': 0.0001,
        'квадрат дециметр': 0.01
      }
    },
    'en': {
      'unit': 'square meter',
      'translations': {
        'square meter': 1,
        'square kilometer': 1000000,
        'hectare': 10000,
        'acre': 100,
        'square millimeter': 0.000001,
        'square centimeter': 0.0001,
        'square decimeter': 0.01
      }
    }
  };
  
  export const scientificDisciplines = {
    'ru': ['Физика', 'Химия', 'Биология', 'Математика', 'Астрономия', 'Геология', 'Информатика', 'Генетика', 'Экология', 'Психология'],
    'kk': ['Физика', 'Химия', 'Биология', 'Математика', 'Астрономия', 'Геология', 'Информатика', 'Генетика', 'Экология', 'Психология'],
    'en': ['Physics', 'Chemistry', 'Biology', 'Mathematics', 'Astronomy', 'Geology', 'Informatics', 'Genetics', 'Ecology', 'Psychology']
  };
 
  export const romanNumerals = {
    1: 'I',
    2: 'II',
    3: 'III',
    4: 'IV',
    5: 'V',
    6: 'VI',
    7: 'VII',
    8: 'VIII',
    9: 'IX',
    10: 'X',
    20: 'XX',
    30: 'XXX',
    40: 'XL',
    50: 'L',
    60: 'LX',
    70: 'LXX',
    80: 'LXXX',
    90: 'XC',
    100: 'C',
    200: 'CC',
    300: 'CCC',
    400: 'CD',
    500: 'D',
    600: 'DC',
    700: 'DCC',
    800: 'DCCC',
    900: 'CM',
    1000: 'M',
  };
  